#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan on staging env 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # heroku_app.workbook will be created
  + resource "heroku_app" "workbook" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = (known after apply)
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = (known after apply)
      + region                = "us"
      + sensitive_config_vars = (sensitive value)
      + stack                 = "container"
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # heroku_build.workbook will be created
  + resource "heroku_build" "workbook" {
      + app               = (known after apply)
      + buildpacks        = (known after apply)
      + id                = (known after apply)
      + local_checksum    = (known after apply)
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)

      + source {
          + checksum = (known after apply)
          + url      = "https://github.com/so-gineers/workbook/archive/refs/tags/0.0.1-alpha-1.tar.gz"
          + version  = "0.0.1-alpha"
        }
    }

  # heroku_formation.workbook will be created
  + resource "heroku_formation" "workbook" {
      + app      = (known after apply)
      + id       = (known after apply)
      + quantity = 1
      + size     = "Standard-1X"
      + type     = "web"
    }

  # random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 20
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + heroku_web_hostname = (known after apply)
  + heroku_web_url      = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Author: @papapathe,
*Action: `pull_request`,
*Working Directory: ``,
*Workflow: `Heroku InfraAsCODE`*